sprout_01/app/controllers/product_controller.rb

  def all_products
    puts "Loading all products from database..."
    @products = Product.order(id: :desc).where(sell_status: "true") #PULLS ITEMS THAT HAVE NOT BEEN BOUGHT
---
SELECT "products".* FROM "products" WHERE "products"."sell_status" = ?  ORDER BY "products"."id" DESC  [["sell_status", "true"]]

  def buy_product
    puts "Loading buy product page..."
    @products = Product.find(params[:id])
    @user = User.find_by_id(session[:user_id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 27]]

  def new_product
    puts "Loading new product form..."
    @user = User.find_by_id(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" DESC LIMIT 1  [["id", 1]]

  def add_product_db
    puts "Adding new product to database..."
    @products = Product.create(product_name: params[:product_name], product_description: params[:product_description], product_price: params[:product_price], sell_status: params[:sell_status], bought_status: params[:bought_status], sellerIDnumber: params[:sellerIDnumber])
---
INSERT INTO "products" ("product_name", "product_description", "sell_status", "seller_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["product_name", ""], ["product_description", ""], ["sell_status", "true"], ["seller_id", 1], ["created_at", "2015-12-18 21:12:22.701953"], ["updated_at", "2015-12-18 21:12:22.701953"]]

  def update_product
    puts "Updating product status in database..."
    @products = Product.update(params[:id], sell_status: params[:sell_status],  bought_status: params[:bought_status], buyerIDnumber: params[:buyerIDnumber])
---
UPDATE "products" SET "sell_status" = ?, "bought_status" = ?, "buyer_id" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["sell_status", "false"], ["bought_status", ""], ["buyer_id", 1], ["updated_at", "2015-12-18 21:42:14.181524"], ["id", 6]]

  def delete_product
    puts "Deleting product from database..."
    @products = Product.destroy(params[:id])
---
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 4]]