sprout_01/app/controllers/user_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "test"], ["last_name", "test"], ["email", "test@test.com"], ["password", "123456789"], ["created_at", "2016-03-28 17:24:13.799924"], ["updated_at", "2016-03-28 17:24:13.799924"]]
---
  def new_user
    puts "Validating form data..."
    @user = User.new(first_name: params[:first_name], last_name: params[:last_name], email: params[:email], password: params[:password])

    if @user.valid?
      puts "Adding new user to database..."
      @user = User.create(first_name: params[:first_name], last_name: params[:last_name], email: params[:email], password: params[:password])

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "sam@sam.com"]]
---
  def login_user
    @user = User.find_by_email(params[:login_email])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def user_dashboard
      puts "Loading user information..."
      @user = User.find_by_id(session[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]
---
  def update_user
    puts "Loading user update form..."
    @user = User.find(params[:id])